namespace Extended.JournalParse
{
    /*************************************************************************
    * Rutoken                                                                *
    * Copyright (c) 2003-2017, CJSC Aktiv-Soft. All rights reserved.         *
    * Подробная информация:  http://www.rutoken.ru                           *
    *------------------------------------------------------------------------*
    * Пример работы с Рутокен при помощи библиотеки PKCS#11 на языке C#      *
    *------------------------------------------------------------------------*
    * Использование команд работы с журналом операций                        *
    *  - установление соединения с Рутокен в первом доступном слоте;         *
    *  - выполнение аутентификации Пользователя;                             *
    *  - получение журнала операций Рутокен;                                 *
    *  - разбор структуры журнала и вывод её на экран;                       *
    *  - сброс прав доступа Пользователя на Рутокен и закрытие               *
    *    соединения с Рутокен.                                               *
    *------------------------------------------------------------------------*
    * Для примера необходима хотя бы одна операция вычисления ЭЦП, например, *
    * выполнение примера SignVerifyGOST34.10-2001.                           *
    *************************************************************************/

    class JournalParse
    {
        static void Main(string[] args)
        {
            // TODO: realize journal parse
        }
    }
}
